cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "homebrew/cask-fonts"

# Core
brew "curl"
brew "htop"
brew "jid"
brew "jq"
brew "md5sha1sum"
brew "stow"
brew "tree"
brew "watch"
brew "wget"
brew "xz"
brew "zsh"

# Dev
brew "asciinema"
brew "awscli"
brew "doctl"
brew "doitlive"
brew "git"
brew "go"
brew "hey"
brew "kubernetes-cli"
brew "kubernets-helm"
brew "kubectx"
brew "node"
brew "packer"
brew "rancher-cli"
brew "rke"
brew "terraform"

# Core
cask "1password"
cask "authy"
cask "boostnote"
cask "code-notes"
cask "dropbox"
cask "flume"
cask "gisto"
cask "google-chrome"
cask "macpass"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "typora"
cask "vlc"
 
# Dev
cask "fork"
cask "gitscout"
cask "insomnia"
cask "iterm2"
cask "postman"
cask "trailer"
cask "virtualbox"

# Fonts
cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-meslo-nerd-font-mono"

# MacOS apps store
mas "Evernote", id: 406056744
mas "Lightcapture", id: 1175859707
mas "Slack", id: 803453959
mas "Pocket", id: 568494494