cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "cloudflare/cloudflare"

# Core
brew "curl"
brew "htop"
brew "jid"
brew "jq"
brew "md5sha1sum"
brew "mas"
brew "stow"
brew "tree"
brew "watch"
brew "wget"
brew "xz"
brew "starship"
brew "tmux"

# Dev
brew "asciinema"
brew "awscli"
brew "azure-cli"
brew "cfssl"
brew "doctl"
brew "doitlive"
brew "git"
brew "go"
brew "hey"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kubectx"
brew "k3d"
brew "k9s"
brew "packer"
brew "terraform"
brew "cloudflared"

# Core
cask "authy"
cask "dropbox"
cask "gisto"
cask "google-chrome"
cask "spotify"
cask "keka"
cask "transmission"
cask "tunnelblick"
cask "typora"
cask "vlc"
cask "teamviewer"
cask "portfolioperformance"
cask "zoom"
cask "microsoft-teams"
cask "signal"
cask "whatsapp"
cask "miro"
cask "lulu"
 
# Dev
cask "insomnia"
cask "iterm2"
cask "hyper"
cask "multipass"
cask "postman"
cask "trailer"
cask "virtualbox"
cask "visual-studio-code"

# Fonts
cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-meslo-nerd-font-mono"
cask "font-hack-nerd-font"

# MacOS apps store
mas "Evernote", id: 406056744
mas "Lightcapture", id: 1175859707
mas "Slack", id: 803453959
mas "Pocket", id: 568494494
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
